protogia/avr-descriptionfiles-4-nim/svd/AT90USB647.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EEPROM</name>
      <description>EEPROM</description>
      <baseAddress>0x0000003F</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EEAR</name>
          <description>EEPROM Address Register Low Bytes</description>
          <addressOffset>0x2</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>EECR</name>
          <description>EEPROM Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EERE</name>
              <description>EEPROM Read Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEPE</name>
              <description>EEPROM Write Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEMPE</name>
              <description>EEPROM Master Write Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EERIE</name>
              <description>EEPROM Ready Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEPM</name>
              <description>EEPROM Programming Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERASE_AND_WRITE_IN_ONE_OPERATION</name>
                  <description>Erase and Write in one operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_ONLY</name>
                  <description>Erase Only</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ONLY</name>
                  <description>Write Only</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDR</name>
          <description>EEPROM Data Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x0000003B</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2D</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EICRA</name>
          <description>External Interrupt Control Register A</description>
          <addressOffset>0x2E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC0</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC1</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC2</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC3</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EICRB</name>
          <description>External Interrupt Control Register B</description>
          <addressOffset>0x2F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC4</name>
              <description>External Interrupt 7-4 Sense Control Bit</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC5</name>
              <description>External Interrupt 7-4 Sense Control Bit</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC6</name>
              <description>External Interrupt 7-4 Sense Control Bit</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC7</name>
              <description>External Interrupt 7-4 Sense Control Bit</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EIFR</name>
          <description>External Interrupt Flag Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTF</name>
              <description>External Interrupt Flags</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EIMSK</name>
          <description>External Interrupt Mask Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>External Interrupt Request 7 Enable</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCICR</name>
          <description>Pin Change Interrupt Control Register</description>
          <addressOffset>0x2D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIE0</name>
              <description>Pin Change Interrupt Enable 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCIFR</name>
          <description>Pin Change Interrupt Flag Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIF0</name>
              <description>Pin Change Interrupt Flag 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK0</name>
          <description>Pin Change Mask Register 0</description>
          <addressOffset>0x30</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
